## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 5 to add, 4 to change, 9 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_inventory_cartography_state_machine"  {
      ~ id      = "712399848" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:794722365809:function:sentinel-neo4j-forwarder"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              + "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder",
              ~ (known after apply),
                # (2 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      - statement {
          - actions       = [
              - "lambda:InvokeFunction",
            ] -> null
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [
              - "arn:aws:lambda:ca-central-1:794722365809:function:sentinel-neo4j-forwarder",
            ] -> null
        }
    }

  # data.template_file.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "asset_inventory_cartography_state_machine"  {
      ~ id       = "03e5a3763293b07d655e5f4c4c8d5aaf390b98ee3b922ab6dfe36b8ab7a855e3" -> (known after apply)
      ~ rendered = jsonencode(
            {
              - Comment        = "Run daily asset inventory of cloud assets"
              - StartAt        = "Get AWS accounts"
              - States         = {
                  - "Get AWS accounts"         = {
                      - Next           = "Map"
                      - Parameters     = {
                          - Name = "/cartography/asset_inventory_account_list"
                        }
                      - Resource       = "arn:aws:states:::aws-sdk:ssm:getParameter"
                      - ResultSelector = {
                          - "accounts.$" = "States.StringToJson($.Parameter.Value)"
                        }
                      - Type           = "Task"
                    }
                  - Map                        = {
                      - ItemsPath      = "$.accounts"
                      - Iterator       = {
                          - StartAt = "Pass"
                          - States  = {
                              - Cartography = {
                                  - End        = true
                                  - Parameters = {
                                      - CapacityProviderStrategy = [
                                          - {
                                              - Base             = 1
                                              - CapacityProvider = "FARGATE_SPOT"
                                              - Weight           = 5
                                            },
                                          - {
                                              - Base             = 0
                                              - CapacityProvider = "FARGATE"
                                              - Weight           = 1
                                            },
                                        ]
                                      - Cluster                  = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
                                      - NetworkConfiguration     = {
                                          - AwsvpcConfiguration = {
                                              - SecurityGroups = [
                                                  - "sg-03caf974f268a3efb",
                                                ]
                                              - Subnets        = [
                                                  - "subnet-08cab5daf34489c53",
                                                  - "subnet-07f8e17bbf11b0797",
                                                  - "subnet-0d92713028fd15243",
                                                ]
                                            }
                                        }
                                      - Overrides                = {
                                          - ContainerOverrides = [
                                              - {
                                                  - Environment = [
                                                      - {
                                                          - Name      = "AWS_ACCOUNT"
                                                          - "Value.$" = "$.account"
                                                        },
                                                      - {
                                                          - Name  = "AWS_CONFIG_FILE"
                                                          - Value = "/config/role_config"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_URI"
                                                          - Value = "bolt://neo4j.internal.local:7687"
                                                        },
                                                      - {
                                                          - Name  = "NEO4J_USER"
                                                          - Value = "neo4j"
                                                        },
                                                    ]
                                                  - Name        = "cartography"
                                                },
                                            ]
                                        }
                                      - TaskDefinition           = "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5"
                                    }
                                  - Resource   = "arn:aws:states:::ecs:runTask.sync"
                                  - Retry      = [
                                      - {
                                          - ErrorEquals     = [
                                              - "States.TaskFailed",
                                            ]
                                          - IntervalSeconds = 120
                                          - MaxAttempts     = 4
                                        },
                                    ]
                                  - Type       = "Task"
                                }
                              - Pass        = {
                                  - Next       = "Cartography"
                                  - Parameters = {
                                      - "account.$" = "$"
                                    }
                                  - Type       = "Pass"
                                }
                            }
                        }
                      - MaxConcurrency = 1
                      - Next           = "Neo4J Sentinel Forwarder"
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - "Neo4J Sentinel Forwarder" = {
                      - End        = true
                      - Parameters = {
                          - FunctionName = "sentinel-neo4j-forwarder"
                        }
                      - Resource   = "arn:aws:states:::lambda:invoke"
                      - Type       = "Task"
                    }
                }
              - TimeoutSeconds = 86400
            }
        ) -> (known after apply)
      ~ template = <<-EOT
            {
              "Comment": "Run daily asset inventory of cloud assets",
              "TimeoutSeconds": 86400,
              "StartAt": "Get AWS accounts",
              "States": {
                "Get AWS accounts": {
                  "Type": "Task",
                  "Next": "Map",
                  "Parameters": {
                    "Name": "/cartography/asset_inventory_account_list"
                  },
                  "Resource": "arn:aws:states:::aws-sdk:ssm:getParameter",
                  "ResultSelector": {
                    "accounts.$": "States.StringToJson($.Parameter.Value)"
                  }
                },
                "Map": {
                  "Type": "Map",
                  "Iterator": {
                    "StartAt": "Pass",
                    "States": {
                      "Pass": {
                        "Type": "Pass",
                        "Next": "Cartography",
                        "Parameters": {
                          "account.$": "$"
                        }
                      },
                      "Cartography": {
                        "Type": "Task",
                        "Resource": "arn:aws:states:::ecs:runTask.sync",
                        "Parameters": {
                          "Cluster": "${CARTOGRAPHY_CLUSTER}",
                          "CapacityProviderStrategy": [
                            {
                              "Base": ${MIN_ECS_CAPACITY},
                              "CapacityProvider": "FARGATE_SPOT",
                              "Weight": ${MAX_ECS_CAPACITY}
                            },
                            {
                              "Base": 0,
                              "CapacityProvider": "FARGATE",
                              "Weight": ${MIN_ECS_CAPACITY}
                            }
                          ],
                          "TaskDefinition": "${CARTOGRAPHY_TASK_DEF}",
                          "Overrides": {
                            "ContainerOverrides": [
                              {
                                "Name": "${CARTOGRAPHY_SERVICE_NAME}",
                                "Environment": [
                                  {
                                    "Name": "AWS_ACCOUNT",
                                    "Value.$": "$.account"
                                  },
                                  {
                                    "Name": "AWS_CONFIG_FILE",
                                    "Value": "/config/role_config"
                                  },
                                  {
                                    "Name": "NEO4J_URI",
                                    "Value": "bolt://neo4j.internal.local:7687"
                                  },
                                  {
                                    "Name": "NEO4J_USER",
                                    "Value": "neo4j"
                                  }
                                ]
                              }
                            ]
                          },
                          "NetworkConfiguration": {
                            "AwsvpcConfiguration": {
                              "SecurityGroups": ["${SECURITY_GROUPS}"],
                              "Subnets":[${SUBNETS}]
                            }
                          }
                        },
                        "Retry": [
                          {
                            "ErrorEquals": ["States.TaskFailed"],
                            "IntervalSeconds": 120,
                            "MaxAttempts": 4
                          }
                        ],
                        "End": true
                      }
                    }
                  },
                  "MaxConcurrency": 1,
                  "ItemsPath": "$.accounts",
                  "ResultPath": null,
                  "Next": "Neo4J Sentinel Forwarder"
                },
          -     "Neo4J Sentinel Forwarder" : {
          -       "Type" : "Task",
          -       "Resource" : "arn:aws:states:::lambda:invoke",
          -       "Parameters" : {
          -         "FunctionName" : "${NEO4J_SENTINEL_FORWARDER_LAMBDA}"
          +     "Neo4J Sentinel Forwarder": {
          +       "Type": "Task",
          +       "Resource": "arn:aws:states:::ecs:runTask.sync",
          +       "Parameters": {
          +         "LaunchType": "FARGATE",
          +         "Cluster" : "${CARTOGRAPHY_CLUSTER}",
          +         "TaskDefinition" : "${SENTINEL_NEO4J_FORWARDER_TASK_DEF}",
          +         "NetworkConfiguration": {
          +           "AwsvpcConfiguration": {
          +             "SecurityGroups": ["${SECURITY_GROUPS}"],
          +             "Subnets":[${SUBNETS}]
          +           }
          +         }
                  },
          +       "Retry": [
          +         {
          +           "ErrorEquals": ["States.TaskFailed"],
          +           "IntervalSeconds": 120,
          +           "MaxAttempts": 4
          +         }
          +       ],
                  "End": true
                }
              }
            }
        EOT
      ~ vars     = {
          - "NEO4J_SENTINEL_FORWARDER_LAMBDA"   = "sentinel-neo4j-forwarder" -> null
          + "SENTINEL_NEO4J_FORWARDER_TASK_DEF" = (known after apply)
            # (7 unchanged elements hidden)
        }
    }

  # data.template_file.sentinel_neo4j_forwarder_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "sentinel_neo4j_forwarder_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "NEO4J_URI"
                          + value = "bolt://neo4j.internal.local:7687"
                        },
                      + {
                          + name  = "NEO4J_USER"
                          + value = "neo4j"
                        },
                      + {
                          + name  = "LOG_TYPE"
                          + value = "${LOG_TYPE}"
                        },
                    ]
                  + essential        = true
                  + image            = "${SENTINEL_NEO4J_FORWARDER_IMAGE}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + name             = "sentinel_neo4j_forwarder"
                  + secrets          = [
                      + {
                          + name      = "NEO4J_SECRETS_PASSWORD"
                          + valueFrom = "${NEO4J_SECRETS_PASSWORD}"
                        },
                      + {
                          + name  = "CUSTOMER_ID"
                          + value = "${CUSTOMER_ID}"
                        },
                      + {
                          + name  = "SHARED_KEY"
                          + value = "${SHARED_KEY}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "AWS_LOGS_GROUP"                 = "/aws/ecs/sentinel_neo4j_forwarder"
          + "AWS_LOGS_REGION"                = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"         = "sentinel_neo4j_forwarder-task"
          + "CUSTOMER_ID"                    = (sensitive)
          + "LOG_TYPE"                       = "CartographyTest"
          + "NEO4J_SECRETS_PASSWORD"         = (sensitive)
          + "NEO4J_URI"                      = "bolt://neo4j.internal.local:7687"
          + "NEO4J_USER"                     = "neo4j"
          + "SENTINEL_NEO4J_FORWARDER_IMAGE" = (known after apply)
          + "SHARED_KEY"                     = (sensitive)
        }
    }

  # aws_cloudwatch_event_rule.asset_inventory_cartography will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "asset_inventory_cartography" {
        id                  = "cartography"
      ~ is_enabled          = false -> true
        name                = "cartography"
        tags                = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.neo4j_to_sentinel will be destroyed
  # (because aws_cloudwatch_log_group.neo4j_to_sentinel is not in configuration)
  - resource "aws_cloudwatch_log_group" "neo4j_to_sentinel" {
      - arn               = "arn:aws:logs:ca-central-1:794722365809:log-group:/aws/lambda/sentinel-neo4j-forwarder" -> null
      - id                = "/aws/lambda/sentinel-neo4j-forwarder" -> null
      - name              = "/aws/lambda/sentinel-neo4j-forwarder" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_log_group.sentinel_neo4j_forwarder will be created
  + resource "aws_cloudwatch_log_group" "sentinel_neo4j_forwarder" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/sentinel_neo4j_forwarder"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
    }

  # aws_ecr_repository.sentinel_neo4j_forwarder will be created
  + resource "aws_ecr_repository" "sentinel_neo4j_forwarder" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "security-tools/cloud_asset_inventory/sentinel_neo4j_forwarder"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_task_definition.sentinel_neo4j_forwarder will be created
  + resource "aws_ecs_task_definition" "sentinel_neo4j_forwarder" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::794722365809:role/cartography_container_execution_role"
      + family                   = "sentinel_neo4j_forwarder"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole"

      + volume {
          + name = "elasticsearch-index-volume"
        }
    }

  # aws_iam_policy.asset_inventory_cartography_state_machine must be replaced
-/+ resource "aws_iam_policy" "asset_inventory_cartography_state_machine" {
      ~ arn       = "arn:aws:iam::794722365809:policy/CartographyStateMachineECSLambda" -> (known after apply)
      ~ id        = "arn:aws:iam::794722365809:policy/CartographyStateMachineECSLambda" -> (known after apply)
      ~ name      = "CartographyStateMachineECSLambda" -> "CartographyStateMachineECS" # forces replacement
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:5",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:794722365809:function:sentinel-neo4j-forwarder"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id = "ANPA3SCJE6FYVVCK3JPFN" -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.cartography_container_execution_role will be updated in-place
  ~ resource "aws_iam_role" "cartography_container_execution_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ Service = [
                              - "lambda.amazonaws.com",
                              - "ecs-tasks.amazonaws.com",
                              - "ec2.amazonaws.com",
                                "ecs.amazonaws.com",
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "cartography_container_execution_role"
        name                  = "cartography_container_execution_role"
        tags                  = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.cartography_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "cartography_task_execution_role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ Service = [
                              - "ecs-tasks.amazonaws.com",
                              - "lambda.amazonaws.com",
                            ] -> "ecs-tasks.amazonaws.com"
                        }
                        # (3 unchanged elements hidden)
                    },
                ]
              ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
